Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.PanelsSlightlyMalformedWarning Property
 Some panels in this curtain system are slightly malformed. The problem is most likely ignorable. This problem usually occurs when a panel or parts of a panel have been divided so that they are very narrow. To better see the malformed panels, temporarily hide the mullion category and set display of lines to ""thin lines"" (using the command on the view menu).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PanelsSlightlyMalformedWarning { get; }
Public Shared ReadOnly Property PanelsSlightlyMalformedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PanelsSlightlyMalformedWarning {
	FailureDefinitionId^ get ();
}
static member PanelsSlightlyMalformedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace